using UnityEngine;

// { から } までを一まとまりとし、
// このまとまりを、『ブロック』もしくは『スコープ』と呼ぶ

// { ブロック }の1行上に書かれているのは、
// そのブロックの設定になる

// C# の基本用語
// - 変数：データを入れておく為の「箱」
// - メソッド：プログラムの処理を一つにまとめた塊（ブロック）
// - クラス：スクリプト全体をまとめた一塊（ブロック）

public class SampleScript : MonoBehaviour
{
    void Start()
    {
        // 処理は必ず『メソッド』の中に記述すること
        Debug.Log("()の中に表示したい文字列...");
        Debug.Log("Startメソッドは開始時に一度だけ実行されます");
    }


    void Update()
    {
        Debug.Log("Updateメソッドは再生中に繰り返し実行されます");
        Debug.Log($"変数などの「値」を表示する 👉 [{10 % 10}]");
    }
}